# `brew tap`
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# `brew install`
brew 'git'
brew 'fish'
brew 'oh-my-posh'
brew 'tmux'

brew 'node'
brew 'python'
brew 'make'

brew 'lsd'
brew 'zoxide'
brew 'czg'
brew 'fzf'
brew 'ripgrep'
brew 'wget'
brew 'bottom'

# `brew install --cask`
cask 'git-credential-manager'
cask 'iterm2'
cask 'codewhisperer'

cask 'google-chrome'
cask 'visual-studio-code'
cask 'obsidian'
cask 'telegram-desktop'

cask 'font-fira-code-nerd-font'
# cask 'font-cascadia-code'
cask 'font-caskaydia-cove-nerd-font'
# cask 'font-jetbrains-mono-nerd-font'
cask 'font-powerline-symbols'
